Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/writs_and_pleadings_introduction.html.txt.tmx
Source language: en
Languages: ga

source: Pleadings (sometimes called writs) are court documents that are exchanged by the parties in a case
ga: Cáipéisí cúirte iad pléadálacha (ar a dtugtar eascairí amanna) a dhéanann na páirtithe a mhalartú i gcás

source: If the case is a High Court or Circuit Court case, the solicitor will usually appoint a barrister to draft the pleadings in the case
ga: Má tá an cás san Ard-Chúirt nó sa Chúirt Chuarda, is gnách go gceapfaidh an t-aturnae abhcóide chun na pléadálacha sa chás a dhréachtú

source: The person who is bringing the case, that is, the person who is suing, is known as the plaintiff or claimant
ga: Tugtar an gearánaí nó an t-éilitheoir ar an duine a bhfuil an cás á dhéanamh acu, is é sin, an duine a bhfuil agairt á dhéanamh acu

source: The person who is being sued is known as the defendant or respondent
ga: Tugtar an cosantóir nó an freagróir ar an duine a bhfuil agairt á dhéanamh air/uirthi

source: If you receive a writ or pleading that was sent to you in error, you should contact the solicitor whose name appears on the document
ga: Má fhaigheann tú eascaire nó pléadáil a seoladh chugat in earráid, ba cheart duit teagmháil a dhéanamh leis an aturnae a luaitear a (h)ainm ar an gcáipéis

source: If the claimant wishes to commence proceedings (that is, to start the legal action) in the District Court, their solicitor prepares and serves a claim notice on the respondent
ga: Más mian leis an éilitheoir tús a chur le himeachtaí, (is é sin, chun tús a chur le caingean dlí) sa Chúirt Dúiche, ullmhaíonn agus seirbheálann a n-aturnae fógra éilimh ar an bhfreagróir

source: The respondent (or their solicitor) then gives or sends to the claimant (or their solicitor) an appearance and defence to show that they intend to defend the case
ga: Tugann nó seolann an freagróir (nó a n-aturnae) láithreas agus cosaint don éilitheoir nó chuig an éilitheoir ansin lena thaispeáint go mbeartaíonn siad an cás a chosaint

source: If the respondent believes that they actually have a claim against the claimant, the respondent includes in the appearance and defence a statement of counterclaim setting out their claim against the claimant
ga: Má chreideann an freagróir go dtarlaíonn go bhfuil éileamh acu i leith an éilitheora, cuireann an freagróir ráiteas frithéilimh san áireamh leis an láithreas agus an chosaint ina leagtar amach a n-éileamh i leith a éilitheora

source: There is more information in our document on District Court procedures
ga: Is féidir leat níos mó faisnéise a léamh inár gcáipéis ar nósanna imeachta na Cúirte Dúiche

source: Circuit Court and High Court cases
ga: Cásanna na Cúirte Cuarda agus na hArd-Chúirte

source: To commence proceedings the plaintiff's barrister prepares a Civil Bill if the case is a Circuit Court case or an originating summons if the case is a High Court case
ga: Chun tús a chur le himeachtaí, ullmhaíonn abhcóide an ghearánaí Bille Sibhialta más bheidh an cás ar siúl sa Chúirt Chuarda, nó toghairm thionscnaimh más bheidh an cás ar siúl san Ard-Chúirt

source: The purpose of these documents is to state the case being made against the defendant
ga: Is é cuspóir na gcáipéisí seo chun an cás atá á dhéanamh i leith an chosantóra a lua

source: For example, if the case is about a road traffic accident, the writ should clearly set out the circumstances of the accident and why and how the defendant is at fault
ga: Mar shampla, má bhaineann an cás le timpiste um thrácht ar bhóithre, ba cheart go leagfar amach go soiléir san eascaire cúinsí na timpiste agus an fáth a bhfuil an locht ar an gcosantóir agus conas atá an locht air/uirthi

source: The document also sets out in detail the injuries that the plaintiff suffered
ga: Chomh maith leis sin, leagtar amach sa cháipéis go mionsonraithe na díobhálacha a raibh an gearánaí thíos leo

source: When the defendant receives the Civil Bill or originating summons, they must enter an appearance to show that they are now a party to the case and intend to defend it
ga: Nuair a fhaigheann an cosantóir an Bille Sibhialta nó an toghairm thionscnaimh, ní mór dóibh láithreas a thaifeadadh lena thaispeáint gur páirtí anois iad sa chás agus go mbeartaíonn siad é a chosaint

source: If it is a High Court case, the plaintiff may then have to send a statement of claim to the defendant
ga: Má bheidh an cás ar siúl san Ard-Chúirt, b’fhéidir go mbeidh ar an ngearánaí ráiteas éilimh a sheoladh chuig an gcosantóir

source: The defendant may send the plaintiff a Notice for Particulars requesting further details and more information
ga: Féadfaidh an cosantóir Fógra le haghaidh Sonraí a sheoladh chuig an ngearánaí ina n-iarrtar ar bhreis sonraí agus níos mó faisnéise

source: When the defendant has received Replies to Particulars, they issue their Defence, setting out why the defendant is not to blame
ga: Nuair a fhaigheann an cosantóir Freagairtí ar Shonraí, eisíonn siad a gCosaint, ina leagtar amach cén fáth nach bhfuil an locht ar an gcosantóir

source: If the defendant believes that they actually have a claim against the plaintiff, the defendant includes a counterclaim with the Defence setting out their claim against the plaintiff
ga: Má chreideann an cosantóir go dtarlaíonn go bhfuil éileamh acu i gcoinne an ghearánaí, cuirfidh an cosantóir frithéileamh san áireamh leis an gCosaint ina leagtar amach a n-éileamh i leith an ghearánaí

source: Further information is available in our documents on Circuir Court procedures and High Court procedures
ga: Tá fáil ar thuilleadh faisnéise inár gcáipéisí ar nósanna imeachta na Cúirte Cuarda agus nósanna imeachta na hArd-Chúirte
